КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПолномочийМЧД/КонтурЛогистика_НастройкиПолномочийМЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПолномочийМЧД</name>
  <resources>
    <name>НаименованиеПолномочия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Полномочие</name>
    <type>
      <types>EnumRef.КонтурЛогистика_Полномочия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТитула</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <comment>При проверке полномочий задается через подключаемы модуль</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПолномочийМЧД/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоПолномочий(); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПолномочий()
	
	дз = Новый ДеревоЗначений;
	Для каждого Реквизит Из Метаданные.РегистрыСведений.КонтурЛогистика_НастройкиПолномочийМЧД.Измерения Цикл
		дз.Колонки.Добавить(Реквизит.Имя);
	КонецЦикла;
	Для каждого Реквизит Из Метаданные.РегистрыСведений.КонтурЛогистика_НастройкиПолномочийМЧД.Ресурсы Цикл
		дз.Колонки.Добавить(Реквизит.Имя);
	КонецЦикла;
	Для каждого Реквизит Из Метаданные.РегистрыСведений.КонтурЛогистика_НастройкиПолномочийМЧД.Реквизиты Цикл
		дз.Колонки.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиПолномочийМЧД.Полномочие КАК Полномочие,
		|	КонтурЛогистика_НастройкиПолномочийМЧД.КодКлассификатора КАК КодКлассификатора,
		|	КонтурЛогистика_НастройкиПолномочийМЧД.ТипТитула КАК ТипТитула,
		|	КонтурЛогистика_НастройкиПолномочийМЧД.ДопПараметр КАК ДопПараметр,
		|	КонтурЛогистика_НастройкиПолномочийМЧД.НаименованиеПолномочия КАК НаименованиеПолномочия
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиПолномочийМЧД КАК КонтурЛогистика_НастройкиПолномочийМЧД
		|ИТОГИ ПО
		|	Полномочие,
		|	ТипТитула,
		|	ДопПараметр";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПолномочие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПолномочие.Следующий() Цикл
		
		ВыборкаТипТитула = ВыборкаПолномочие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаТипТитула.Следующий() Цикл
			
			ВыборкаДопПараметр = ВыборкаТипТитула.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаДопПараметр.Следующий() Цикл
								
				СтрокаПолномочие = дз.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПолномочие, ВыборкаДопПараметр);
				
				ВыборкаДетальныеЗаписи = ВыборкаДопПараметр.Выбрать();	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Стр = СтрокаПолномочие.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(Стр, ВыборкаДетальныеЗаписи);	
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если дз.Строки.Количество() = 0 Тогда
		
		Для каждого Полномочие Из Метаданные.Перечисления.КонтурЛогистика_Полномочия.ЗначенияПеречисления Цикл
			СтрокаПолномочие = дз.Строки.Добавить();
			СтрокаПолномочие.Полномочие = Перечисления.КонтурЛогистика_Полномочия[Полномочие.Имя];
		КонецЦикла;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(дз, "ДеревоПолномочий");
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолномочие(Команда)
	
	ТекДанные = Элементы.ДеревоПолномочий.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	
	Если ТекДанные <> Неопределено Тогда
			
		ПараметрыФормы.Вставить("Полномочие", ТекДанные.Полномочие);
		ПараметрыФормы.Вставить("ТипТитула", ТекДанные.ТипТитула);
		ПараметрыФормы.Вставить("ДопПараметр", ТекДанные.ДопПараметр);
				
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_НастройкиПолномочийМЧД.Форма.ФормаЗаписи", 
			ПараметрыФормы, 
			, 
			ЭтаФорма, 
			"ОбработчикДобавленияПолномочия");
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДобавленияПолномочия(Запись, Параметр2) Экспорт
	
	Если Запись = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоПолномочий();
	
	Для каждого СтрПолномочие Из ДеревоПолномочий.ПолучитьЭлементы() Цикл
		
		//Элементы.ДеревоПолномочий.Развернуть(СтрПолномочие.ПолучитьИдентификатор());
		
		Для каждого СтрКод Из СтрПолномочие.ПолучитьЭлементы() Цикл
		
			Если СтрКод.Полномочие = Запись.Полномочие 
				И СтрКод.ТипТитула = Запись.ТипТитула
				И СтрКод.ДопПараметр = Запись.ДопПараметр
				И СтрКод.КодКлассификатора = Запись.КодКлассификатора Тогда
											
				Элементы.ДеревоПолномочий.ТекущаяСтрока = СтрКод.ПолучитьИдентификатор();
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//ДобавленнаяЗапись = Результат.Запись;	
	//
	//Если ДобавленнаяЗапись = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если Результат.ИзменениеЗаписи Тогда
	//	
	//	Для каждого Стр Из ДеревоПолномочий.ПолучитьЭлементы() Цикл
	//		
	//		Если Стр.Полномочие = ДобавленнаяЗапись.Полномочие 
	//			И Стр.ТипТитула = ДобавленнаяЗапись.ТипТитула
	//			И Стр.ТипТитула = ДобавленнаяЗапись.ДопПараметр
	//			И Стр.ТипТитула = ДобавленнаяЗапись.КодКлассификатора Тогда
	//			
	//			НоваяСтрока = Стр.ПолучитьЭлементы().Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавленнаяЗапись);
	//			
	//			НовоеПолномочие = Ложь;
	//			
	//			Элементы.ДеревоПолномочий.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//Иначе
	//		
	//	НовоеПолномочие = Истина;
	//	
	//	Для каждого Стр Из ДеревоПолномочий.ПолучитьЭлементы() Цикл
	//		
	//		Если Стр.Полномочие = ДобавленнаяЗапись.Полномочие И Стр.ТипТитула = ДобавленнаяЗапись.ТипТитула Тогда
	//			
	//			НоваяСтрока = Стр.ПолучитьЭлементы().Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавленнаяЗапись);
	//			
	//			НовоеПолномочие = Ложь;
	//			
	//			Элементы.ДеревоПолномочий.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	Если НовоеПолномочие Тогда
	//		
	//		НоваяСтрокаРодитель = ДеревоПолномочий.ПолучитьЭлементы().Добавить();
	//		НоваяСтрокаРодитель.Полномочие = ДобавленнаяЗапись.Полномочие;
	//		НоваяСтрокаРодитель.ТипТитула = ДобавленнаяЗапись.ТипТитула;
	//		НоваяСтрокаРодитель.ДопПараметр = ДобавленнаяЗапись.ДопПараметр;
	//		
	//		НоваяСтрока = НоваяСтрокаРодитель.ПолучитьЭлементы().Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавленнаяЗапись);
	//		
	//		Элементы.ДеревоПолномочий.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолномочийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные = Элементы.ДеревоПолномочий.ТекущиеДанные;	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Уровень = УровеньДереваЗначений();
	
	Если Уровень >= 1 Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УровеньДереваЗначений()
	
	ТекСтр = Элементы.ДеревоПолномочий.ТекущиеДанные;
	
	Уровень = 0;
	
	Пока Истина Цикл
		
		Если ТекСтр.ПолучитьРодителя() <> Неопределено Тогда
			Уровень = Уровень + 1;
			ТекСтр = ТекСтр.ПолучитьРодителя();
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Уровень;
	
КонецФункции

&НаКлиенте
Процедура ДеревоПолномочийПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.ДеревоПолномочий.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	 		
	ДанныеДляУдаления = Новый Структура;
	ДанныеДляУдаления.Вставить("Полномочие", ТекДанные.Полномочие);
	
	Если ТекДанные.ПолучитьРодителя() <> Неопределено Тогда
		ДанныеДляУдаления.Вставить("КодКлассификатора", ТекДанные.КодКлассификатора);
	КонецЕсли;
	
	ДанныеДляУдаления.Вставить("ТипТитула", ТекДанные.ТипТитула);
	ДанныеДляУдаления.Вставить("ДопПараметр", ТекДанные.ДопПараметр);
		
	УдалитьПолномочие(ДанныеДляУдаления);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПолномочие(ДанныеДляУдаления)
	
	НаборЗаписей = РегистрыСведений.КонтурЛогистика_НастройкиПолномочийМЧД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Полномочие.Установить(ДанныеДляУдаления.Полномочие);
	
	Если ДанныеДляУдаления.Свойство("КодКлассификатора") Тогда
		НаборЗаписей.Отбор.КодКлассификатора.Установить(ДанныеДляУдаления.КодКлассификатора);
	КонецЕсли;
	
	НаборЗаписей.Отбор.ТипТитула.Установить(ДанныеДляУдаления.ТипТитула);
	НаборЗаписей.Отбор.ДопПараметр.Установить(ДанныеДляУдаления.ДопПараметр);
	
	НаборЗаписей.Записать(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолномочийПолномочиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.ДеревоПолномочий.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПолномочие(Команда)
	
	ТекДанные = Элементы.ДеревоПолномочий.ТекущиеДанные;
	 		
	Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.КодКлассификатора) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаписи = Новый Структура("Полномочие, КодКлассификатора, ТипТитула, ДопПараметр",
				ТекДанные.Полномочие, ТекДанные.КодКлассификатора, ТекДанные.ТипТитула, ТекДанные.ДопПараметр);
	
	МассивКонструктораКлюча = Новый Массив;
	МассивКонструктораКлюча.Добавить(СтруктураЗаписи);
	
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.КонтурЛогистика_НастройкиПолномочийМЧД", МассивКонструктораКлюча);
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_НастройкиПолномочийМЧД.Форма.ФормаЗаписи", 
			ПараметрыФормы, 
			, 
			ЭтаФорма, 
			"ОбработчикДобавленияПолномочия");	
	
КонецПроцедуры
